Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: This module provides support for maintaining a list in sorted order without having to sort the list after each insertion. For long lists of items with expensive comparison operations, this can be an improvement over the more common approach. The module is called :mod:`bisect` because it uses a basic bisection algorithm to do its work. The source code may be most useful as a working example of the algorithm (the boundary conditions are already right!).
pl: Ten moduł dostarcza wsparcia dla utrzymywania listy w posortowanym porządku bez konieczności sortowania listy po każdym wstawieniu. Dla długich list przedmiotów o kosztownych operacjach porównania, to może być polepszenie względem bardziej typowego podejścia. Moduł jest zwany :mod:`bisect` ponieważ używa używa podstawowego algorytmu bisekcji aby wykonać swoją pracę. Kod źródłowy może być najbardziej użyteczny jako działający przykład algorytmu (warunki brzegowe są już od razu poprawne!).

source: The following functions are provided:
pl: Następujące zadania są dostarczone:

source: Locate the proper insertion point for *x* in *a* to maintain sorted order. The parameters *lo* and *hi* may be used to specify a subset of the list which should be considered; by default the entire list is used. If *x* is already present in *a*, the insertion point will be before (to the left of) any existing entries. The return value is suitable for use as the first parameter to ``list.insert()``. This assumes that *a* is already sorted.
pl: Znajdź poprawny punkt wstawienia dla *x* w *a* aby utrzymać posortowany porządek. Parametry *lo* i *hi* mogą być użyte do określenia podzbioru listy który powinien być brany pod uwagę; domyślnie cała lista jest używana. Jeśli *x* jest już obecne w *a* punkt wstawiania będzie przed (po lewej stronie) jakimikolwiek wpisami. Wartość zwracana jest dobra do użycia jako pierwszy parametr ``list.insert()``. To zakłada że *a* jest już posortowana.

source: Similar to :func:`bisect_left`, but returns an insertion point which comes after (to the right of) any existing entries of *x* in *a*.
pl: Podobna do zadania :func:`bisect_left` ale zwraca punkt wstawiania który jest po (po prawej stronie od) jakichkolwiek wpisów *x* w *a*.

source: Insert *x* in *a* in sorted order. This is equivalent to ``a.insert(bisect.bisect_left(a, x, lo, hi), x)``. This assumes that *a* is already sorted.
pl: Wstaw *x* w *a* w posortowany sposób. To jest równoważne do ``a.insert(bisect_left(a, x, lo, hi), x)``. To zakłada że *a* jest już posortowane.

source: Similar to :func:`insort_left`, but inserting *x* in *a* after any existing entries of *x*.
pl: podobne do zadania :func:`insort_left`, ale wstawiając *x* w *a* po jakichkolwiek wpisach *x*.

source: Examples
pl: Przykłady

source: The :func:`bisect` function is generally useful for categorizing numeric data. This example uses :func:`bisect` to look up a letter grade for an exam total (say) based on a set of ordered numeric breakpoints: 85 and up is an 'A', 75..84 is a 'B', etc.
pl: Zadanie :func:`bisect` jest ogólnie użyteczne dla kategoryzacji danych numerycznych. Ten przykład używa :func:`bisect` aby podejrzeć literową ocenę za sumę z egzaminu (powiedzmy) w oparciu o zbiór uporządkowanych numerycznych punktów przerwań: 85 i więcej dla 'A', 75..84 dla 'B', itd.

source: Unlike the :func:`sorted` function, it does not make sense for the :func:`bisect` functions to have *key* or *reversed* arguments because that would lead to an inefficent design (successive calls to bisect functions would not "remember" all of the previous key lookups).
pl: W przeciwieństwie do zadania :func:`sorted`, nie ma sensu dla zadań :func:`bisect` mieć *kluczowe* - z ang. - *key* lub *odwrócone* - z ang. - *reversed* parametry ponieważ to mogłoby prowadzić do nieefektywnego układu (kolejne wywołania zadań bisekcji nie "pamiętałyby" wszystkich poprzednich podejrzeń klucza).

source: Instead, it is better to search a list of precomputed keys to find the index of the record in question::
pl: Zamiast tego, lepiej jest przeszukać listę uprzednio obliczonych wartości kluczowych aby odnaleźć indeks poszukiwanego zapisu::

source: >>> data = [('red', 5), ('blue', 1), ('yellow', 8), ('black', 0)] >>> data.sort(key=lambda r: r[1]) >>> keys = [r[1] for r in data] # precomputed list of keys >>> data[bisect_left(keys, 0)] ('black', 0) >>> data[bisect_left(keys, 1)] ('blue', 1) >>> data[bisect_left(keys, 5)] ('red', 5) >>> data[bisect_left(keys, 8)] ('yellow', 8)
pl: >>> data = [('czerwony', 5), ('niebieski', 1), ('żółty', 8), ('czarny', 0)] >>> data.sort(key=lambda r: r[1]) >>> keys = [r[1] for r in data] # przeliczona uprzednio lista kluczy >>> data[bisect_left(keys, 0)] ('czarny', 0) >>> data[bisect_left(keys, 1)] ('niebieski', 1) >>> data[bisect_left(keys, 5)] ('czerwony', 5) >>> data[bisect_left(keys, 8)] ('żółty', 8)

source: :mod:`builtins` --- Built-in objects
pl: :mod:`builtins` --- przedmioty wbudowane

source: This module provides direct access to all 'built-in' identifiers of Python; for example, ``builtins.open`` is the full name for the built-in function :func:`open`.
pl: Ten moduł dostarcza bezpośredni dostęp do wszystkich 'wbudowanych' identyfikatorów języka pytonowskiego; dla przykładu ``builtins.open`` jest pełną nazwą dla wbudowanego zadania :func:`open`.

source: This module is not normally accessed explicitly by most applications, but can be useful in modules that provide objects with the same name as a built-in value, but in which the built-in of that name is also needed. For example, in a module that wants to implement an :func:`open` function that wraps the built-in :func:`open`, this module can be used directly::
pl: Dostęp do tego modułu nie jest zwykle otrzymywany jawnie przy większości aplikacji, ale może być użyteczny w modułach które dostarczają przedmiotów o tej samej nazwie jak wartość wbudowana, ale w których wbudowany przedmiot o tej nazwie jest także wymagany. Dla przykładu w module który chce wypełnić zadanie :func:`open` w szczególny sposób które opakowuje wbudowane zadanie :func:`open`, ten moduł może być używany bezpośrednio::

source: import builtins def open(path): f = builtins.open(path, 'r') return UpperCaser(f) class UpperCaser: '''Wrapper around a file that converts output to upper-case.''' def __init__(self, f): self._f = f def read(self, count=-1): return self._f.read(count).upper() # ...
pl: import builtins def open(path): f = builtins.open(path, 'r') return UpperCaser(f) class UpperCaser: '''Opakowanie wokół pliku które zamienia wyjście na wielkie litery.''' def __init__(self, f): self._f = f def read(self, count=-1): return self._f.read(count).upper() # ...

source: As an implementation detail, most modules have the name ``__builtins__`` (note the ``'s'``) made available as part of their globals. The value of ``__builtins__`` is normally either this module or the value of this modules's :attr:`__dict__` attribute. Since this is an implementation detail, it may not be used by alternate implementations of Python.
pl: Jako szczegół wypełnienia, większość modułów ma nazwę ``__builtins__`` (zauważ ``'s'``) dostępną jako część ich przedmiotów globalnych - w znaczeniu nadrzędnych. Wartość ``__builtins__`` jest zwykle tym modułem lub wartością właściwości :attr:`__dict__` tego modułu. Ponieważ jest to szczegół wypełnienia, nie może to być wykorzystane przez odmienne wypełnienia języka pytonowskiego.

source: :mod:`bz2` --- Compression compatible with :program:`bzip2`
pl: :mod:`bz2` --- Kompresja odpowiadająca programowi :program:`bzip2`

source: This module provides a comprehensive interface for the bz2 compression library. It implements a complete file interface, one-shot (de)compression functions, and types for sequential (de)compression.
pl: Ten moduł dostarcza zrozumiałego sprzęgu dla biblioteki kompresji bz2. Wypełnia całkowicie sprzęg pliku, jednorazowego-uruchomienia zadania (de)kompresji i typów dla (de)kompresji sekwencyjnej.

source: For other archive formats, see the :mod:`gzip`, :mod:`zipfile`, and :mod:`tarfile` modules.
pl: Dla innych formatów archiwów, zobacz moduły :mod:`gzip`, :mod:`zipfile`, i :mod:`tarfile`.

source: Here is a summary of the features offered by the bz2 module:
pl: Tu jest podsumowanie właściwości oferowanych przez moduł bz2:

source: :class:`BZ2File` class implements a complete file interface, including :meth:`~BZ2File.readline`, :meth:`~BZ2File.readlines`, :meth:`~BZ2File.writelines`, :meth:`~BZ2File.seek`, etc;
pl: Uogólnienie :class:`BZ2File` wypełnia kompletny sprzęg pliku zawierając sposoby postępowania :meth:`~BZ2File.readline`, :meth:`~BZ2File.readlines`, :meth:`~BZ2File.writelines`, :meth:`~BZ2File.seek`, itd;

source: :class:`BZ2File` class implements emulated :meth:`~BZ2File.seek` support;
pl: Uogólnienie :class:`BZ2File` wypełnia emulowane wsparcie dla :meth:`~BZ2File.seek`

source: :class:`BZ2File` class implements universal newline support;
pl: Uogólnienie :class:`BZ2File` wypełnia wsparcie dla uniwersalnego nowego wiersza;

source: :class:`BZ2File` class offers an optimized line iteration using the readahead algorithm borrowed from file objects;
pl: Uogólnienie :class:`BZ2File` oferuje optymalizowaną iterację linii używając algorytmu wczytywania z wyprzedzeniem zapożyczonego od przedmiotów plików;

source: Sequential (de)compression supported by :class:`BZ2Compressor` and :class:`BZ2Decompressor` classes;
pl: Sekwencyjna (de)kompresja wspierana przez uogólnienia :class:`BZ2Compressor` i :class:`BZ2Decompressor`.

source: One-shot (de)compression supported by :func:`compress` and :func:`decompress` functions;
pl: "Jednego-strzału" (de)kompresja wspierana przez zadania :func:`compress` i :func:`decompress`;

source: Thread safety uses individual locking mechanism.
pl: Bezpieczeństwo wątków używa indywidualnego mechanizmu blokowania.

source: (De)compression of files
pl: (De)kompresja plików

source: Handling of compressed files is offered by the :class:`BZ2File` class.
pl: Obsługa skompresowanych plików jest oferowana przez uogólnienie :class:`BZ2File`

source: Open a bz2 file. Mode can be either ``'r'`` or ``'w'``, for reading (default) or writing. When opened for writing, the file will be created if it doesn't exist, and truncated otherwise. If *buffering* is given, ``0`` means unbuffered, and larger numbers specify the buffer size; the default is ``0``. If *compresslevel* is given, it must be a number between ``1`` and ``9``; the default is ``9``. Add a ``'U'`` to mode to open the file for input with universal newline support. Any line ending in the input file will be seen as a ``'\n'`` in Python. Also, a file so opened gains the attribute :attr:`newlines`; the value for this attribute is one of ``None`` (no newline read yet), ``'\r'``, ``'\n'``, ``'\r\n'`` or a tuple containing all the newline types seen. Universal newlines are available only when reading. Instances support iteration in the same way as normal :class:`file` instances.
pl: Otwórz plik bz2. Tryb może być albo ``'r'`` albo ``'w'``, dla wczytywania (dmyślnego) lub zapisywania. Gdy otwarty na pisanie, plik zostanie utworzony jeśli nie istnieje, i obcięty w przeciwnym wypadku. Jeśli *przestrzeń wymiany* jest dana, ``0`` oznacza bez przestrzeni wymiany, zaś większe liczby określają rozmiar przestrzeni wymiany; domyślna wartość jest ``0``. Jeśli *compresslevel* - z ang. - poziom kompresji jest dany, musi być liczbą pomiędzy ``1`` i ``9``; domyślna jest ``9``. Dodaj ``'U'`` do trybu aby otworzyć plik dla wczytywania ze wsparciem dla uniwersalnego nowego wiersza. Dowolne linie kończące się w pliku wejściowym będą widziane jako ``' '`` w języku pytonowskim. Także plik tak otwarty zyskuje właściwość :attr:`newlines`; wartość tej właściwości jest jedną z ``None`` (- nie wczytano jeszcze nowej linii), ``' '``, ``' '``, ``' '`` lub krotka zawierająca wszystkie typy nowego wiersza zaobserwowane. Uniwersalne nowe linie są dostępne tylko przy wczytywaniu. Przykłady wspierają iterację w ten sam sposób jak zwykłe przykłady :class:`file`.

source: :class:`BZ2File` supports the :keyword:`with` statement.
pl: Uogólnienie :class:`BZ2File` wspiera wyrażenie :keyword:`with` - z ang. - :keyword:`z`.

source: Close the file. Sets data attribute :attr:`closed` to true. A closed file cannot be used for further I/O operations. :meth:`close` may be called more than once without error.
pl: Zamknij plik. Ustawia właściwość danych :attr:`closed` na prawdę. Zamknięty plik nie może być używany dla dalszych operacji I/O - wejścia/wyjścia. Sposób postępowania :meth:`close` może być wywoływany więcej niż raz bez błędu.

source: Read at most *size* uncompressed bytes, returned as a byte string. If the *size* argument is negative or omitted, read until EOF is reached.
pl: Wczytaj nie więcej niż *size* nieskompresowanych bajtów zwracanych jako ciąg bajtów. Jeśli parametr *size* jest ujemny bądź pominięty, wczytuj aż napotkasz znak końca pliku - z ang. - EOF.

source: Return the next line from the file, as a byte string, retaining newline. A non-negative *size* argument limits the maximum number of bytes to return (an incomplete line may be returned then). Return an empty byte string at EOF.
pl: Zwróć następną linię z pliku, jako ciąg bajtów zachowując znak nowego wiersza. Nieujemny parametr *size* ogranicza maksymalną liczbę bajtów do zwrócenia (niekompletna linia może być w ten sposób zwrócona). Zwróć pusty ciąg bajtów w momencie napotkania EOF.

source: Return a list of lines read. The optional *size* argument, if given, is an approximate bound on the total number of bytes in the lines returned.
pl: Zwróć listę wczytanych linii. Opcjonalny parametr *size* jeśli dany jest przybliżoną granicą całkowitej liczby bajtów w zwróconych liniach.

source: Move to new file position. Argument *offset* is a byte count. Optional argument *whence* defaults to ``os.SEEK_SET`` or ``0`` (offset from start of file; offset should be ``>= 0``); other values are ``os.SEEK_CUR`` or ``1`` (move relative to current position; offset can be positive or negative), and ``os.SEEK_END`` or ``2`` (move relative to end of file; offset is usually negative, although many platforms allow seeking beyond the end of a file).
pl: Przesuń do nowej pozycji pliku. Parametr *offset* jest liczbą bajtów. Opcjonalny parametr *whence* domyślnie równy jest ``os.SEEK_SET`` lub ``0`` (przesunięcie względem początku pliku; przesunięcie powinno być ``>= 0``); inne wartości są ``os.SEEK_CUR`` lub ``1`` (przesuń względem obecnej pozycji; przesunięcie może być dodatnie lub ujemne), i ``os.SEEK_END`` lub ``2`` (przesuń względem końca pliku; przesunięcie jest zwykle ujemne, chociaż wiele maszyn/środowisk pozwala na przeszukiwanie poza końcem pliku).

source: Note that seeking of bz2 files is emulated, and depending on the parameters the operation may be extremely slow.
pl: Zauważ że przeszukiwanie pliku bz2 jest emulowane, i w zależności od parametrów operacja może być bardzo powolna.

source: Return the current file position, an integer.
pl: Zwróć pozycję w obecnym pliku, liczbę całkowitą.

source: Write the byte string *data* to file. Note that due to buffering, :meth:`close` may be needed before the file on disk reflects the data written.
pl: Zapisz ciąg bajtów *data* do pliku. Zauważ, że z powodu przestrzeni wymiany, sposób postępowania :meth:`close` może być konieczny zanim plik na dysku będzie odzwierciedlał dane zapisane.

source: Write the sequence of byte strings to the file. Note that newlines are not added. The sequence can be any iterable object producing byte strings. This is equivalent to calling write() for each byte string.
pl: Zapisz sekwencję ciągów bajtów do pliku. Zauważ, że nowe linie nie są dodawane. Sekwencja może być dowolnym iterowalnym przedmiotem produkującym ciągi bajtów. To jest równoważne wywołaniu zapisu write() dla każdego ciągu bajtów.

source: Sequential (de)compression
pl: Sekwencyjna (de)kompresja

source: Sequential compression and decompression is done using the classes :class:`BZ2Compressor` and :class:`BZ2Decompressor`.
pl: Sekwencyjna kompresja i dekompresja jest wykonywana używając uogólnień :class:`BZ2Compressor` i :class:`BZ2Decompressor`.

source: Create a new compressor object. This object may be used to compress data sequentially. If you want to compress data in one shot, use the :func:`compress` function instead. The *compresslevel* parameter, if given, must be a number between ``1`` and ``9``; the default is ``9``.
pl: Stwórz nowy przedmiot kompresora. Ten przedmiot może być użyty do kompresowania danych sekwencyjnie. Jeśli chcesz skompresować dane za jednym zamachem, użyj zadania :func:`compress` zamiast tego. Parametr *compresslevel* jeśli dany musi być liczbą pomiędzy ``1`` i ``9``; domyślnie jest ``9``.

source: Provide more data to the compressor object. It will return chunks of compressed data whenever possible. When you've finished providing data to compress, call the :meth:`flush` method to finish the compression process, and return what is left in internal buffers.
pl: Dostarcz więcej danych do przedmiotu kompresora. Zwróci kawałki skompresowanych danych gdzie jest to możliwe. Gdy skończysz dostarczać dane do skompresowania, wywołaj sposób postępowania :meth:`flush` do zakończenia procesu kompresowania i zwróć to co zostało w wewnętrznych przestrzeniach wymiany.

source: Finish the compression process and return what is left in internal buffers. You must not use the compressor object after calling this method.
pl: Zakończ proces kompresji i zwróć to co zostało w wewnętrznych przestrzeniach wymiany. Nie można używać więcej przedmiotu kompresora po wywołaniu tego sposobu postępowania.

source: Create a new decompressor object. This object may be used to decompress data sequentially. If you want to decompress data in one shot, use the :func:`decompress` function instead.
pl: Utwórz nowy przedmiot dekompresora. Ten przedmiot może być używany do dekompresji danych sekwencyjnie. Jeśli chcesz dekompresować dane za jednym zamachem, użyj zadania :func:`decompress` zamiast tego.

source: Provide more data to the decompressor object. It will return chunks of decompressed data whenever possible. If you try to decompress data after the end of stream is found, :exc:`EOFError` will be raised. If any data was found after the end of stream, it'll be ignored and saved in :attr:`unused_data` attribute.
pl: Dostarcz więcej danych do przedmiotu dekompresora. Zwróci kawałki dekompresowanych danych gdy to możliwe. Jeśli będziesz próbował dekompresować dane po napotkaniu końca strumienia, wyjątek :exc:`EOFError` zostanie zgłoszony. Jeśli jakiekolwiek dane zostaną napotkane po końcu strumienia, zostaną zignorowane i zapisane we właściwości :attr:`unused_data`.

source: One-shot (de)compression
pl: Jedno-razowa (de)kompresja

source: One-shot compression and decompression is provided through the :func:`compress` and :func:`decompress` functions.
pl: Jedno-razowa kompresja i dekompresja jest dostarczona przez zadania :func:`compress` i :func:`decompress`.

source: Compress *data* in one shot. If you want to compress data sequentially, use an instance of :class:`BZ2Compressor` instead. The *compresslevel* parameter, if given, must be a number between ``1`` and ``9``; the default is ``9``.
pl: Zkompresuj *dane* za jednym zamachem. Jeśli chcesz kompresować dane sekwencyjnie, użyj przykładu uogólnienia :class:`BZ2Compressor` zamiast tego. Parametr *compresslevel*, jeśli dany musi być liczbą pomiędzy ``1`` i ``9``; domyślnie jest to ``9``.

source: Decompress *data* in one shot. If you want to decompress data sequentially, use an instance of :class:`BZ2Decompressor` instead.
pl: Dekompresuj *dane* za jednym zamachem. Jeśli chcesz dekompresować dane sekwencyjnie, użyj przykładu uogólnienia :class:`BZ2Decompressor` zamiast tego.

source: :mod:`calendar` --- General calendar-related functions
pl: :mod:`calendar` --- Ogólnie zadania związane z kalendarzem.

source: This module allows you to output calendars like the Unix :program:`cal` program, and provides additional useful functions related to the calendar. By default, these calendars have Monday as the first day of the week, and Sunday as the last (the European convention). Use :func:`setfirstweekday` to set the first day of the week to Sunday (6) or to any other weekday. Parameters that specify dates are given as integers. For related functionality, see also the :mod:`datetime` and :mod:`time` modules.
pl: Ten moduł pozwala ci produkować kalendarze tak jak program Unix-a :program:`cal`, i dostarcza dodatkowych użytecznych zadań związanych z kalendarzem. Domyślnie te kalendarze mają poniedziałek jako pierwszy dzień tygodnia, i niedzielę jako ostatni (konwencja Europejska). Użyj zadania :func:`setfirstweekday` aby ustawić pierwszy dzień tygodnia na niedzielę (6) lub jakikolwiek inny dzień tygodnia. Parametry które określają daty podane są jako liczby całkowite. Dla powiązanej funkcjonalności zobacz moduły :mod:`datetime` i :mod:`time`.

source: Most of these functions and classes rely on the :mod:`datetime` module which uses an idealized calendar, the current Gregorian calendar indefinitely extended in both directions. This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book "Calendrical Calculations", where it's the base calendar for all computations.
pl: Większość z tych zadań i uogólnień opiera się na module :mod:`datetime`, który używa idealizowanego kalendarza, obecnego kalendarza Gregoriańskiego rozciągniętego bez ograniczeń w obu kierunkach. To odpowiada definicji proleptycznego kalendarza Gregoriańskiego w książce "Kalendarzowe obliczenia" Dershowitza i Reingold-a, gdzie jest on podstawowym kalendarzem dla wszystkich obliczeń.

source: Creates a :class:`Calendar` object. *firstweekday* is an integer specifying the first day of the week. ``0`` is Monday (the default), ``6`` is Sunday.
pl: Tworzy przedmiot :class:`Calendar`. *Pierwszy dzień tygodnia* - z ang. - *firstweekday* jest liczbą całkowitą określającą pierwszy dzień tygodnia. ``0`` jest Poniedziałkiem (domyślnie), ``6`` jest Niedzielą.

source: A :class:`Calendar` object provides several methods that can be used for preparing the calendar data for formatting. This class doesn't do any formatting itself. This is the job of subclasses.
pl: Przedmiot uogólnienia :class:`Calendar` dostarcza kilkanaście metod, które mogą być używane dla przygotowania danych kalendarza dla formatowania. To uogólnienie nie robi żadnego formatowania samodzielnie. To jest zadaniem podrzędnych uogólnień.

source: :class:`Calendar` instances have the following methods:
pl: przykłady :class:`Calendar` mają następujące sposoby postępowania:

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`firstweekday` property.
pl: Zwróć przedmiot iterujący dla numerów dni tygodnia które będą użyte w jednym tygodniu. Pierwsza wartość z przedmiotu iterującego będzie taka sama jak wartość właściwości :attr:`firstweekday`.

source: Return an iterator for the month *month* (1-12) in the year *year*. This iterator will return all days (as :class:`datetime.date` objects) for the month and all days before the start of the month or after the end of the month that are required to get a complete week.
pl: Zwróć przedmiot iterujący dla miesiąca *month* (1-12) w roku *year*. Przedmiot iterujący będzie zwracał wszystkie dni (jako przedmioty :class:`datetime.date`) dla miesiąca i wszystkie dni przed początkiem miesiąca lub po końcu miesiąca które są wymagane aby otrzymać pełen tydzień.
